;; -*- no-byte-compile: t; -*-
;;; ~/.doom.d/packages.el

;;; Examples:
;; (package! some-package)
;; (package! another-package :recipe (:fetcher github :repo "username/repo"))
;; (package! builtin-package :disable t)
(package! evil-fringe-mark)
(package! deadgrep)
(package! evil-owl)
(package! forge :disable t)
;; (package! slime :recipe (:host github :repo "manateelazycat/snails" :files ("*.el"))) ;; doesnt work with straight
;; (package! company-flx)
;; (package! dired-sidebar)
;; (package! inertial-scroll :recipe (:host github :repo "kiwanami/emacs-inertial-scroll" :files ("*.el")))

;; (package! dired-toggle)
;; (package! ellocate)
;; (package! fast-scroll)
(package! bm)
;; (package! nimbus-theme)
(package! annot :recipe (:host github :repo "ghoshi/annot" :files ("src/*.el")))
(package! annotate)
(package! undo-propose)
(package! imenu-list)